loadtest/results/atomic-hot_seat.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /scripts/hot_seat.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m0s max duration (incl. graceful stop):
              * hot_seat: 50 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 50/50 VUs, 5875 complete and 0 interrupted iterations
hot_seat   [   3% ] 50 VUs  01.0s/30s

running (0m02.0s), 50/50 VUs, 12993 complete and 0 interrupted iterations
hot_seat   [   7% ] 50 VUs  02.0s/30s

running (0m03.0s), 50/50 VUs, 20458 complete and 0 interrupted iterations
hot_seat   [  10% ] 50 VUs  03.0s/30s

running (0m04.0s), 50/50 VUs, 26041 complete and 0 interrupted iterations
hot_seat   [  13% ] 50 VUs  04.0s/30s

running (0m05.0s), 50/50 VUs, 33199 complete and 0 interrupted iterations
hot_seat   [  17% ] 50 VUs  05.0s/30s

running (0m06.0s), 50/50 VUs, 40157 complete and 0 interrupted iterations
hot_seat   [  20% ] 50 VUs  06.0s/30s

running (0m07.0s), 50/50 VUs, 47885 complete and 0 interrupted iterations
hot_seat   [  23% ] 50 VUs  07.0s/30s

running (0m08.0s), 50/50 VUs, 55132 complete and 0 interrupted iterations
hot_seat   [  27% ] 50 VUs  08.0s/30s

running (0m09.0s), 50/50 VUs, 61950 complete and 0 interrupted iterations
hot_seat   [  30% ] 50 VUs  09.0s/30s

running (0m10.0s), 50/50 VUs, 69283 complete and 0 interrupted iterations
hot_seat   [  33% ] 50 VUs  10.0s/30s

running (0m11.0s), 50/50 VUs, 76442 complete and 0 interrupted iterations
hot_seat   [  37% ] 50 VUs  11.0s/30s

running (0m12.0s), 50/50 VUs, 83807 complete and 0 interrupted iterations
hot_seat   [  40% ] 50 VUs  12.0s/30s

running (0m13.0s), 50/50 VUs, 91160 complete and 0 interrupted iterations
hot_seat   [  43% ] 50 VUs  13.0s/30s

running (0m14.0s), 50/50 VUs, 97042 complete and 0 interrupted iterations
hot_seat   [  47% ] 50 VUs  14.0s/30s

running (0m15.0s), 50/50 VUs, 103068 complete and 0 interrupted iterations
hot_seat   [  50% ] 50 VUs  15.0s/30s

running (0m16.0s), 50/50 VUs, 110070 complete and 0 interrupted iterations
hot_seat   [  53% ] 50 VUs  16.0s/30s

running (0m17.0s), 50/50 VUs, 117937 complete and 0 interrupted iterations
hot_seat   [  57% ] 50 VUs  17.0s/30s

running (0m18.0s), 50/50 VUs, 125781 complete and 0 interrupted iterations
hot_seat   [  60% ] 50 VUs  18.0s/30s

running (0m19.0s), 50/50 VUs, 132936 complete and 0 interrupted iterations
hot_seat   [  63% ] 50 VUs  19.0s/30s

running (0m20.0s), 50/50 VUs, 140076 complete and 0 interrupted iterations
hot_seat   [  67% ] 50 VUs  20.0s/30s

running (0m21.0s), 50/50 VUs, 148202 complete and 0 interrupted iterations
hot_seat   [  70% ] 50 VUs  21.0s/30s

running (0m22.0s), 50/50 VUs, 156147 complete and 0 interrupted iterations
hot_seat   [  73% ] 50 VUs  22.0s/30s

running (0m23.0s), 50/50 VUs, 164469 complete and 0 interrupted iterations
hot_seat   [  77% ] 50 VUs  23.0s/30s

running (0m24.0s), 50/50 VUs, 172171 complete and 0 interrupted iterations
hot_seat   [  80% ] 50 VUs  24.0s/30s

running (0m25.0s), 50/50 VUs, 180119 complete and 0 interrupted iterations
hot_seat   [  83% ] 50 VUs  25.0s/30s

running (0m26.0s), 50/50 VUs, 187496 complete and 0 interrupted iterations
hot_seat   [  87% ] 50 VUs  26.0s/30s

running (0m27.0s), 50/50 VUs, 195768 complete and 0 interrupted iterations
hot_seat   [  90% ] 50 VUs  27.0s/30s

running (0m28.0s), 50/50 VUs, 204049 complete and 0 interrupted iterations
hot_seat   [  93% ] 50 VUs  28.0s/30s

running (0m29.0s), 50/50 VUs, 211884 complete and 0 interrupted iterations
hot_seat   [  97% ] 50 VUs  29.0s/30s

running (0m30.0s), 50/50 VUs, 219943 complete and 0 interrupted iterations
hot_seat   [ 100% ] 50 VUs  30.0s/30s


  █ THRESHOLDS 

    booking_failed
    ✓ 'count==0' count=0

    http_req_duration
    ✓ 'p(95)<1000' p(95)=10.1ms


  █ TOTAL RESULTS 

    checks_total.......: 220114  7335.926625/s
    checks_succeeded...: 100.00% 220114 out of 220114
    checks_failed......: 0.00%   0 out of 220114

    ✓ settled as 201 or 409

    CUSTOM
    booking_conflicted.............: 220083 7334.893461/s
    booking_failed.................: 0      0/s
    booking_won....................: 31     1.033163/s

    HTTP
    http_req_duration..............: avg=6.77ms min=739.45µs med=6.7ms  max=63.64ms p(90)=8.89ms p(95)=10.1ms 
      { expected_response:true }...: avg=6.77ms min=739.45µs med=6.7ms  max=63.64ms p(90)=8.89ms p(95)=10.1ms 
    http_req_failed................: 0.00%  0 out of 220114
    http_reqs......................: 220114 7335.926625/s

    EXECUTION
    iteration_duration.............: avg=6.81ms min=832.5µs  med=6.73ms max=65.55ms p(90)=8.94ms p(95)=10.16ms
    iterations.....................: 220114 7335.926625/s
    vus............................: 50     min=50          max=50
    vus_max........................: 50     min=50          max=50

    NETWORK
    data_received..................: 38 MB  1.3 MB/s
    data_sent......................: 39 MB  1.3 MB/s



running (0m30.0s), 00/50 VUs, 220114 complete and 0 interrupted iterations
hot_seat ✓ [ 100% ] 50 VUs  30s