loadtest/results/atomic-hot_seat.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /scripts/hot_seat.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m0s max duration (incl. graceful stop):
              * hot_seat: 50 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 50/50 VUs, 6412 complete and 0 interrupted iterations
hot_seat   [   3% ] 50 VUs  01.0s/30s

running (0m02.0s), 50/50 VUs, 10207 complete and 0 interrupted iterations
hot_seat   [   7% ] 50 VUs  02.0s/30s

running (0m03.0s), 50/50 VUs, 16305 complete and 0 interrupted iterations
hot_seat   [  10% ] 50 VUs  03.0s/30s

running (0m04.0s), 50/50 VUs, 22946 complete and 0 interrupted iterations
hot_seat   [  13% ] 50 VUs  04.0s/30s

running (0m05.0s), 50/50 VUs, 28970 complete and 0 interrupted iterations
hot_seat   [  17% ] 50 VUs  05.0s/30s

running (0m06.0s), 50/50 VUs, 36001 complete and 0 interrupted iterations
hot_seat   [  20% ] 50 VUs  06.0s/30s

running (0m07.0s), 50/50 VUs, 43657 complete and 0 interrupted iterations
hot_seat   [  23% ] 50 VUs  07.0s/30s

running (0m08.0s), 50/50 VUs, 51036 complete and 0 interrupted iterations
hot_seat   [  27% ] 50 VUs  08.0s/30s

running (0m09.0s), 50/50 VUs, 58724 complete and 0 interrupted iterations
hot_seat   [  30% ] 50 VUs  09.0s/30s

running (0m10.0s), 50/50 VUs, 65366 complete and 0 interrupted iterations
hot_seat   [  33% ] 50 VUs  10.0s/30s

running (0m11.0s), 50/50 VUs, 72177 complete and 0 interrupted iterations
hot_seat   [  37% ] 50 VUs  11.0s/30s

running (0m12.0s), 50/50 VUs, 79690 complete and 0 interrupted iterations
hot_seat   [  40% ] 50 VUs  12.0s/30s

running (0m13.0s), 50/50 VUs, 87824 complete and 0 interrupted iterations
hot_seat   [  43% ] 50 VUs  13.0s/30s

running (0m14.0s), 50/50 VUs, 95042 complete and 0 interrupted iterations
hot_seat   [  47% ] 50 VUs  14.0s/30s

running (0m15.0s), 50/50 VUs, 102176 complete and 0 interrupted iterations
hot_seat   [  50% ] 50 VUs  15.0s/30s

running (0m16.0s), 50/50 VUs, 109895 complete and 0 interrupted iterations
hot_seat   [  53% ] 50 VUs  16.0s/30s

running (0m17.0s), 50/50 VUs, 117025 complete and 0 interrupted iterations
hot_seat   [  57% ] 50 VUs  17.0s/30s

running (0m18.0s), 50/50 VUs, 124440 complete and 0 interrupted iterations
hot_seat   [  60% ] 50 VUs  18.0s/30s

running (0m19.0s), 50/50 VUs, 132056 complete and 0 interrupted iterations
hot_seat   [  63% ] 50 VUs  19.0s/30s

running (0m20.0s), 50/50 VUs, 139173 complete and 0 interrupted iterations
hot_seat   [  67% ] 50 VUs  20.0s/30s

running (0m21.0s), 50/50 VUs, 145550 complete and 0 interrupted iterations
hot_seat   [  70% ] 50 VUs  21.0s/30s

running (0m22.0s), 50/50 VUs, 153016 complete and 0 interrupted iterations
hot_seat   [  73% ] 50 VUs  22.0s/30s

running (0m23.0s), 50/50 VUs, 161281 complete and 0 interrupted iterations
hot_seat   [  77% ] 50 VUs  23.0s/30s

running (0m24.0s), 50/50 VUs, 169598 complete and 0 interrupted iterations
hot_seat   [  80% ] 50 VUs  24.0s/30s

running (0m25.0s), 50/50 VUs, 177323 complete and 0 interrupted iterations
hot_seat   [  83% ] 50 VUs  25.0s/30s

running (0m26.0s), 50/50 VUs, 185098 complete and 0 interrupted iterations
hot_seat   [  87% ] 50 VUs  26.0s/30s

running (0m27.0s), 50/50 VUs, 192406 complete and 0 interrupted iterations
hot_seat   [  90% ] 50 VUs  27.0s/30s

running (0m28.0s), 50/50 VUs, 199667 complete and 0 interrupted iterations
hot_seat   [  93% ] 50 VUs  28.0s/30s

running (0m29.0s), 50/50 VUs, 206868 complete and 0 interrupted iterations
hot_seat   [  97% ] 50 VUs  29.0s/30s

running (0m30.0s), 50/50 VUs, 214647 complete and 0 interrupted iterations
hot_seat   [ 100% ] 50 VUs  30.0s/30s


  █ THRESHOLDS 

    booking_failed
    ✓ 'count==0' count=0

    http_req_duration
    ✓ 'p(95)<1000' p(95)=10.5ms


  █ TOTAL RESULTS 

    checks_total.......: 214751  7156.818985/s
    checks_succeeded...: 100.00% 214751 out of 214751
    checks_failed......: 0.00%   0 out of 214751

    ✓ settled as 201 or 409

    CUSTOM
    booking_conflicted.............: 214720 7155.785875/s
    booking_failed.................: 0      0/s
    booking_won....................: 31     1.03311/s

    HTTP
    http_req_duration..............: avg=6.94ms min=530.37µs med=6.77ms max=109.75ms p(90)=9.13ms p(95)=10.5ms 
      { expected_response:true }...: avg=6.94ms min=530.37µs med=6.77ms max=109.75ms p(90)=9.13ms p(95)=10.5ms 
    http_req_failed................: 0.00%  0 out of 214751
    http_reqs......................: 214751 7156.818985/s

    EXECUTION
    iteration_duration.............: avg=6.98ms min=554.54µs med=6.8ms  max=110.69ms p(90)=9.18ms p(95)=10.57ms
    iterations.....................: 214751 7156.818985/s
    vus............................: 50     min=50          max=50
    vus_max........................: 50     min=50          max=50

    NETWORK
    data_received..................: 37 MB  1.2 MB/s
    data_sent......................: 37 MB  1.2 MB/s



running (0m30.0s), 00/50 VUs, 214751 complete and 0 interrupted iterations
hot_seat ✓ [ 100% ] 50 VUs  30s