loadtest/results/atomic-spread.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /scripts/spread.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m0s max duration (incl. graceful stop):
              * spread: 50 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 50/50 VUs, 8202 complete and 0 interrupted iterations
spread   [   3% ] 50 VUs  01.0s/30s

running (0m02.0s), 50/50 VUs, 20804 complete and 0 interrupted iterations
spread   [   7% ] 50 VUs  02.0s/30s

running (0m03.0s), 50/50 VUs, 32869 complete and 0 interrupted iterations
spread   [  10% ] 50 VUs  03.0s/30s

running (0m04.0s), 50/50 VUs, 45507 complete and 0 interrupted iterations
spread   [  13% ] 50 VUs  04.0s/30s

running (0m05.0s), 50/50 VUs, 57967 complete and 0 interrupted iterations
spread   [  17% ] 50 VUs  05.0s/30s

running (0m06.0s), 50/50 VUs, 70886 complete and 0 interrupted iterations
spread   [  20% ] 50 VUs  06.0s/30s

running (0m07.0s), 50/50 VUs, 83919 complete and 0 interrupted iterations
spread   [  23% ] 50 VUs  07.0s/30s

running (0m08.0s), 50/50 VUs, 94873 complete and 0 interrupted iterations
spread   [  27% ] 50 VUs  08.0s/30s

running (0m09.0s), 50/50 VUs, 104773 complete and 0 interrupted iterations
spread   [  30% ] 50 VUs  09.0s/30s

running (0m10.0s), 50/50 VUs, 114604 complete and 0 interrupted iterations
spread   [  33% ] 50 VUs  10.0s/30s

running (0m11.0s), 50/50 VUs, 126466 complete and 0 interrupted iterations
spread   [  37% ] 50 VUs  11.0s/30s

running (0m12.0s), 50/50 VUs, 135528 complete and 0 interrupted iterations
spread   [  40% ] 50 VUs  12.0s/30s

running (0m13.0s), 50/50 VUs, 145457 complete and 0 interrupted iterations
spread   [  43% ] 50 VUs  13.0s/30s

running (0m14.0s), 50/50 VUs, 158541 complete and 0 interrupted iterations
spread   [  47% ] 50 VUs  14.0s/30s

running (0m15.0s), 50/50 VUs, 171847 complete and 0 interrupted iterations
spread   [  50% ] 50 VUs  15.0s/30s

running (0m16.0s), 50/50 VUs, 184091 complete and 0 interrupted iterations
spread   [  53% ] 50 VUs  16.0s/30s

running (0m17.0s), 50/50 VUs, 197940 complete and 0 interrupted iterations
spread   [  57% ] 50 VUs  17.0s/30s

running (0m18.0s), 50/50 VUs, 210960 complete and 0 interrupted iterations
spread   [  60% ] 50 VUs  18.0s/30s

running (0m19.0s), 50/50 VUs, 221946 complete and 0 interrupted iterations
spread   [  63% ] 50 VUs  19.0s/30s

running (0m20.0s), 50/50 VUs, 231255 complete and 0 interrupted iterations
spread   [  67% ] 50 VUs  20.0s/30s

running (0m21.0s), 50/50 VUs, 242942 complete and 0 interrupted iterations
spread   [  70% ] 50 VUs  21.0s/30s

running (0m22.0s), 50/50 VUs, 253426 complete and 0 interrupted iterations
spread   [  73% ] 50 VUs  22.0s/30s

running (0m23.0s), 50/50 VUs, 259102 complete and 0 interrupted iterations
spread   [  77% ] 50 VUs  23.0s/30s

running (0m24.0s), 50/50 VUs, 268311 complete and 0 interrupted iterations
spread   [  80% ] 50 VUs  24.0s/30s

running (0m25.0s), 50/50 VUs, 280251 complete and 0 interrupted iterations
spread   [  83% ] 50 VUs  25.0s/30s

running (0m26.0s), 50/50 VUs, 291465 complete and 0 interrupted iterations
spread   [  87% ] 50 VUs  26.0s/30s

running (0m27.0s), 50/50 VUs, 305564 complete and 0 interrupted iterations
spread   [  90% ] 50 VUs  27.0s/30s

running (0m28.0s), 50/50 VUs, 316704 complete and 0 interrupted iterations
spread   [  93% ] 50 VUs  28.0s/30s

running (0m29.0s), 50/50 VUs, 329849 complete and 0 interrupted iterations
spread   [  97% ] 50 VUs  29.0s/30s

running (0m30.0s), 50/50 VUs, 343889 complete and 0 interrupted iterations
spread   [ 100% ] 50 VUs  30.0s/30s


  █ THRESHOLDS 

    booking_failed
    ✓ 'count==0' count=0

    http_req_duration
    ✓ 'p(95)<1000' p(95)=7.38ms


  █ TOTAL RESULTS 

    checks_total.......: 344051  11466.812914/s
    checks_succeeded...: 100.00% 344051 out of 344051
    checks_failed......: 0.00%   0 out of 344051

    ✓ settled as 201 or 409

    CUSTOM
    booking_conflicted.............: 52909  1763.394393/s
    booking_failed.................: 0      0/s
    booking_won....................: 291142 9703.41852/s

    HTTP
    http_req_duration..............: avg=4.27ms min=281.08µs med=3.77ms max=72.76ms p(90)=5.96ms p(95)=7.38ms
      { expected_response:true }...: avg=4.27ms min=281.08µs med=3.77ms max=72.76ms p(90)=5.96ms p(95)=7.38ms
    http_req_failed................: 0.00%  0 out of 344051
    http_reqs......................: 344051 11466.812914/s

    EXECUTION
    iteration_duration.............: avg=4.35ms min=429.41µs med=3.84ms max=72.85ms p(90)=6.06ms p(95)=7.51ms
    iterations.....................: 344051 11466.812914/s
    vus............................: 50     min=50          max=50
    vus_max........................: 50     min=50          max=50

    NETWORK
    data_received..................: 89 MB  3.0 MB/s
    data_sent......................: 60 MB  2.0 MB/s



running (0m30.0s), 00/50 VUs, 344051 complete and 0 interrupted iterations
spread ✓ [ 100% ] 50 VUs  30s